package homeWorkJava.homework02_Operatory_i_peremennye;
/*
 * Задание 4
 * Написать программу, которая выведет на консоль «Hello 
 * world», не используя в исходном коде пробельных символов. 
 */
public class Task04 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		System.out.println("Hello" + (char)160 + "world");
	}

}
